# python3
# Create date: 2021-05-18
# Author: Scc_hy
# Func: 建模需要的基础信息

PROJECT_PATH = 'D:/Python_data/My_python/Projects/AIWIN_nlp_news_2021'
V1_NEED_COLUMNS = ['NEWS_BASICINFO_SID', 'NEWS_TITLE', 'ABSTRACT' ,'CONTENT',  'COMPANY_NM', 'LABEL']
V1_IGNORE_LIST = '/ [ ] 【 】 、 ， , 。 . * “ ” " " ‘ ’ ! ? ！ ？ ： （ ） ( ) - | ｜ 《 》 ； 的 ; 被 等 及 为 与 了'.split(' ') + [' ', '#']
V1_SEED = 42


LABEL_INVERSE_DICT = {1: '信息披露违规', 0: '主板/创业板/中小板/债券退市', 6: '环境污染', 5: '无',
 10: '被监管机构罚款或查处', 8: '股票质押率过高', 11: '被采取监管措施',
 12: '重大诉讼仲裁', 9: '被政府职能部门处罚', 3: '安全事故', 4: '实控人变更',
 7: '破产重整', 2: '债务逾期'}

LABEL_ENCODE_DICT = {'信息披露违规': 1, '主板/创业板/中小板/债券退市': 0, '环境污染': 6, '无': 5, 
'被监管机构罚款或查处': 10, '股票质押率过高': 8, '被采取监管措施': 11, 
'重大诉讼仲裁': 12, '被政府职能部门处罚': 9, '安全事故': 3, '实控人变更': 4, 
'破产重整': 7, '债务逾期': 2}

NEW_LABEL_ENCODE_DICT = {'信息披露违规': 1, '主板/创业板/中小板/债券退市': 0, '环境污染': 6, '无': 5, 
'被监管机构罚款或查处&被采取监管措施': 10, '股票质押率过高': 8, '重大诉讼仲裁': 11, '被政府职能部门处罚': 9, 
'安全事故': 3, '实控人变更': 4, 
'破产重整': 7, '债务逾期': 2}


NEW_LABEL_INVERSE_DICT = {1: '信息披露违规', 0: '主板/创业板/中小板/债券退市', 6: '环境污染', 5: '无', 
10: '被监管机构罚款或查处&被采取监管措施', 8: '股票质押率过高', 11: '重大诉讼仲裁', 9: '被政府职能部门处罚', 
3: '安全事故', 4: '实控人变更', 
7: '破产重整', 2: '债务逾期'}